; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	satellite6 - satellite
	instrument8 - instrument
	thermograph3 - mode
	image2 - mode
	image1 - mode
	image0 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star6 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 image0)
	(supports instrument1 thermograph3)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument2 thermograph3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star1)
	(supports instrument4 image1)
	(supports instrument4 image2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star1)
	(on_board instrument7 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation0)
	(supports instrument8 image1)
	(supports instrument8 thermograph3)
	(supports instrument8 image0)
	(calibration_target instrument8 Star6)
	(on_board instrument8 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star2)
)
(:goal (and
	(pointing satellite3 GroundStation7)
	(pointing satellite5 Star3)
	(pointing satellite6 GroundStation4)
	(have_image Star8 image2)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 thermograph3)
	(have_image Planet11 image0)
	(have_image Planet12 image2)
))

)

; plan
1. (turn_to satellite5 star3 groundstation0)
   deleted: (pointing satellite5 groundstation0)
   added: (pointing satellite5 star3)
   goals met: 1 of 8
2. (turn_to satellite3 groundstation7 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 groundstation7)
   goals met: 2 of 8
3. (turn_to satellite1 groundstation5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation5)
   goals met: 2 of 8
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 8
5. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 2 of 8
6. (turn_to satellite1 planet11 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet11)
   goals met: 2 of 8
7. (take_image satellite1 planet11 instrument1 image0)
   added: (have_image planet11 image0)
   goals met: 3 of 8
8. (turn_to satellite1 phenomenon10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 8
9. (take_image satellite1 phenomenon10 instrument1 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 4 of 8
10. (turn_to satellite1 planet12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet12)
   goals met: 4 of 8
11. (take_image satellite1 planet12 instrument1 image2)
   added: (have_image planet12 image2)
   goals met: 5 of 8
12. (turn_to satellite1 star8 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star8)
   goals met: 5 of 8
13. (take_image satellite1 star8 instrument1 image2)
   added: (have_image star8 image2)
   goals met: 6 of 8
14. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 6 of 8
15. (take_image satellite1 star9 instrument1 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 7 of 8
16. (turn_to satellite6 groundstation4 star2)
   deleted: (pointing satellite6 star2)
   added: (pointing satellite6 groundstation4)
   goals met: 8 of 8
